[NoCoverage] BlockStatement
exercises/ShippingRates/services/CorreiosService.ts:4:46
 import CorreiosShippingService from "../contracts/CorreiosShippingService";
 
 export default class CorreiosService implements CorreiosShippingService {
-  getCorreiosShippingRates (zipCode: string) {
-    return 0
-  }
+  getCorreiosShippingRates (zipCode: string) {}
 }
