[Killed] BlockStatement
exercises/ShippingRates/models/Cart.ts:9:27
   readonly items: Item[]
   user: User
 
-  constructor(user: User) {
-    this.user = user
-    this.items = []
-  }
+  constructor(user: User) {}
 
   addProduct (product: Product, amount: number): void {

[Killed] ArrayDeclaration
exercises/ShippingRates/models/Cart.ts:11:18
 
   constructor(user: User) {
     this.user = user
-    this.items = []
+    this.items = ["Stryker was here"]
   }
 

[Killed] BlockStatement
exercises/ShippingRates/models/Cart.ts:14:55
     this.items = []
   }
 
-  addProduct (product: Product, amount: number): void {
-    const indexOfProduct = this.items.findIndex(item => item.product.name === product.name)
-
-    if (indexOfProduct !== -1) {
-      this.items[indexOfProduct].amount += amount
-      return
-    }
-
-    this.items.push({ product, amount })
-  }
+  addProduct (product: Product, amount: number): void {}
 
   removeItem (productName: string): void {

[Killed] ConditionalExpression
exercises/ShippingRates/models/Cart.ts:15:57
   }
 
   addProduct (product: Product, amount: number): void {
-    const indexOfProduct = this.items.findIndex(item => item.product.name === product.name)
+    const indexOfProduct = this.items.findIndex(item => false)
 
     if (indexOfProduct !== -1) {

[Killed] ConditionalExpression
exercises/ShippingRates/models/Cart.ts:15:57
   }
 
   addProduct (product: Product, amount: number): void {
-    const indexOfProduct = this.items.findIndex(item => item.product.name === product.name)
+    const indexOfProduct = this.items.findIndex(item => true)
 
     if (indexOfProduct !== -1) {

[Killed] UnaryOperator
exercises/ShippingRates/models/Cart.ts:17:28
   addProduct (product: Product, amount: number): void {
     const indexOfProduct = this.items.findIndex(item => item.product.name === product.name)
 
-    if (indexOfProduct !== -1) {
+    if (indexOfProduct !== +1) {
       this.items[indexOfProduct].amount += amount
       return

[Killed] ConditionalExpression
exercises/ShippingRates/models/Cart.ts:17:9
   addProduct (product: Product, amount: number): void {
     const indexOfProduct = this.items.findIndex(item => item.product.name === product.name)
 
-    if (indexOfProduct !== -1) {
+    if (true) {
       this.items[indexOfProduct].amount += amount
       return

[Killed] ObjectLiteral
exercises/ShippingRates/models/Cart.ts:22:21
       return
     }
 
-    this.items.push({ product, amount })
+    this.items.push({})
   }
 

[Killed] BlockStatement
exercises/ShippingRates/models/Cart.ts:25:42
     this.items.push({ product, amount })
   }
 
-  removeItem (productName: string): void {
-    const indexOfProduct = this.items.findIndex(item => item.product.name === productName)
-
-    if (indexOfProduct !== -1) {
-      this.items.splice(indexOfProduct, 1)
-      return
-    }
-
-    throw new Error("Product not found");
-  }
+  removeItem (productName: string): void {}
 
   getTotalPrice (): number {

[Killed] ConditionalExpression
exercises/ShippingRates/models/Cart.ts:26:57
   }
 
   removeItem (productName: string): void {
-    const indexOfProduct = this.items.findIndex(item => item.product.name === productName)
+    const indexOfProduct = this.items.findIndex(item => false)
 
     if (indexOfProduct !== -1) {

[Killed] EqualityOperator
exercises/ShippingRates/models/Cart.ts:26:57
   }
 
   removeItem (productName: string): void {
-    const indexOfProduct = this.items.findIndex(item => item.product.name === productName)
+    const indexOfProduct = this.items.findIndex(item => item.product.name !== productName)
 
     if (indexOfProduct !== -1) {

[Killed] BlockStatement
exercises/ShippingRates/models/Cart.ts:28:32
   removeItem (productName: string): void {
     const indexOfProduct = this.items.findIndex(item => item.product.name === productName)
 
-    if (indexOfProduct !== -1) {
-      this.items.splice(indexOfProduct, 1)
-      return
-    }
+    if (indexOfProduct !== -1) {}
 
     throw new Error("Product not found");

[Killed] ConditionalExpression
exercises/ShippingRates/models/Cart.ts:28:9
   removeItem (productName: string): void {
     const indexOfProduct = this.items.findIndex(item => item.product.name === productName)
 
-    if (indexOfProduct !== -1) {
+    if (false) {
       this.items.splice(indexOfProduct, 1)
       return

[Killed] BlockStatement
exercises/ShippingRates/models/Cart.ts:36:28
     throw new Error("Product not found");
   }
 
-  getTotalPrice (): number {
-    let price = 0
-    price = this.items.reduce((totalPrice, item) => totalPrice + item.amount * item.product.price, 0)
-
-    return price
-  }
+  getTotalPrice (): number {}
 
   getAmountOfProducts (): number {

[Killed] ArrowFunction
exercises/ShippingRates/models/Cart.ts:38:31
 
   getTotalPrice (): number {
     let price = 0
-    price = this.items.reduce((totalPrice, item) => totalPrice + item.amount * item.product.price, 0)
+    price = this.items.reduce(() => undefined, 0)
 
     return price

[Killed] ArithmeticOperator
exercises/ShippingRates/models/Cart.ts:38:53
 
   getTotalPrice (): number {
     let price = 0
-    price = this.items.reduce((totalPrice, item) => totalPrice + item.amount * item.product.price, 0)
+    price = this.items.reduce((totalPrice, item) => totalPrice - item.amount * item.product.price, 0)
 
     return price

[Killed] BlockStatement
exercises/ShippingRates/models/Cart.ts:43:34
     return price
   }
 
-  getAmountOfProducts (): number {
-    let amountOfProducts = 0
-
-    amountOfProducts = this.items.reduce((amount, item) => amount + item.amount, 0)
-    return amountOfProducts
-  }
+  getAmountOfProducts (): number {}
 
 }

[Killed] ArrowFunction
exercises/ShippingRates/models/Cart.ts:46:42
   getAmountOfProducts (): number {
     let amountOfProducts = 0
 
-    amountOfProducts = this.items.reduce((amount, item) => amount + item.amount, 0)
+    amountOfProducts = this.items.reduce(() => undefined, 0)
     return amountOfProducts
   }

[Killed] ArithmeticOperator
exercises/ShippingRates/models/Cart.ts:46:60
   getAmountOfProducts (): number {
     let amountOfProducts = 0
 
-    amountOfProducts = this.items.reduce((amount, item) => amount + item.amount, 0)
+    amountOfProducts = this.items.reduce((amount, item) => amount - item.amount, 0)
     return amountOfProducts
   }
