[Killed] BlockStatement
exercises/ShippingRates/services/ShippingRatesService.ts:8:65
 
   correiosShippingService: CorreiosShippingService
 
-  constructor(correiosShippingService: CorreiosShippingService) {
-    this.correiosShippingService = correiosShippingService
-  }
+  constructor(correiosShippingService: CorreiosShippingService) {}
 
   calculateShippingRates = (cart: Cart) => {

[Killed] BlockStatement
exercises/ShippingRates/services/ShippingRatesService.ts:12:44
     this.correiosShippingService = correiosShippingService
   }
 
-  calculateShippingRates = (cart: Cart) => {
-    let shippingRate = 0
-
-    if (cart.items.length === 0) throw new Error("Cart is empty");
-
-    if (cart.getTotalPrice() < 100) {
-      shippingRate = shippingRate +
-        this.correiosShippingService.getCorreiosShippingRates(cart.user.zipCode)
-    }
-
-    return shippingRate
-  }
+  calculateShippingRates = (cart: Cart) => {}
 }

[Killed] ConditionalExpression
exercises/ShippingRates/services/ShippingRatesService.ts:15:9
   calculateShippingRates = (cart: Cart) => {
     let shippingRate = 0
 
-    if (cart.items.length === 0) throw new Error("Cart is empty");
+    if (false) throw new Error("Cart is empty");
 
     if (cart.getTotalPrice() < 100) {

[Killed] ConditionalExpression
exercises/ShippingRates/services/ShippingRatesService.ts:15:9
   calculateShippingRates = (cart: Cart) => {
     let shippingRate = 0
 
-    if (cart.items.length === 0) throw new Error("Cart is empty");
+    if (true) throw new Error("Cart is empty");
 
     if (cart.getTotalPrice() < 100) {

[Killed] EqualityOperator
exercises/ShippingRates/services/ShippingRatesService.ts:17:9
 
     if (cart.items.length === 0) throw new Error("Cart is empty");
 
-    if (cart.getTotalPrice() < 100) {
+    if (cart.getTotalPrice() <= 100) {
       shippingRate = shippingRate +
         this.correiosShippingService.getCorreiosShippingRates(cart.user.zipCode)

[Killed] ConditionalExpression
exercises/ShippingRates/services/ShippingRatesService.ts:17:9
 
     if (cart.items.length === 0) throw new Error("Cart is empty");
 
-    if (cart.getTotalPrice() < 100) {
+    if (false) {
       shippingRate = shippingRate +
         this.correiosShippingService.getCorreiosShippingRates(cart.user.zipCode)

[Killed] ArithmeticOperator
exercises/ShippingRates/services/ShippingRatesService.ts:18:22
     if (cart.items.length === 0) throw new Error("Cart is empty");
 
     if (cart.getTotalPrice() < 100) {
-      shippingRate = shippingRate +
-        this.correiosShippingService.getCorreiosShippingRates(cart.user.zipCode)
+      shippingRate = shippingRate - this.correiosShippingService.getCorreiosShippingRates(cart.user.zipCode)
     }
 
