[Killed] BlockStatement
exercises/ShippingRates/models/Product.ts:5:44
   name: string
   price: number
 
-  constructor(name: string, price: number) {
-    this.name = name
-    this.price = price
-  }
+  constructor(name: string, price: number) {}
 }
