[Survived] BlockStatement
exercises/ShippingRates/models/User.ts:5:46
   name: string
   zipCode: string
 
-  constructor(name: string, zipCode: string) {
-    this.name = name
-    this.zipCode = zipCode
-  }
+  constructor(name: string, zipCode: string) {}
 }
