[Killed] BlockStatement
src/exercises/happyNumbers/happy.ts:1:72
-export const calculatesSumOfSquaresOfDigits = (num: number): number => {
-  const splitNumber = num.toString().split('');
-  const digits = splitNumber.map((number) => parseInt(number));
-
-  let sum = 0;
-
-  for (const digit of digits) {
-    sum += Math.pow(digit, 2);
-  }
-  return sum;
-};
+export const calculatesSumOfSquaresOfDigits = (num: number): number => {};
 
 export const checksHappyNumber = (num: number): boolean => {

[Killed] StringLiteral
src/exercises/happyNumbers/happy.ts:2:44
 export const calculatesSumOfSquaresOfDigits = (num: number): number => {
-  const splitNumber = num.toString().split('');
+  const splitNumber = num.toString().split("Stryker was here!");
   const digits = splitNumber.map((number) => parseInt(number));
 

[Killed] ArrowFunction
src/exercises/happyNumbers/happy.ts:3:34
 export const calculatesSumOfSquaresOfDigits = (num: number): number => {
   const splitNumber = num.toString().split('');
-  const digits = splitNumber.map((number) => parseInt(number));
+  const digits = splitNumber.map(() => undefined);
 
   let sum = 0;

[Killed] BlockStatement
src/exercises/happyNumbers/happy.ts:7:31
 
   let sum = 0;
 
-  for (const digit of digits) {
-    sum += Math.pow(digit, 2);
-  }
+  for (const digit of digits) {}
   return sum;
 };

[Killed] BlockStatement
src/exercises/happyNumbers/happy.ts:13:60
   return sum;
 };
 
-export const checksHappyNumber = (num: number): boolean => {
-  if (num < 1 || num % 1 !== 0) return false;
-  const numbersCovered = [];
-
-  while (num !== 1) {
-    const sumOfSquaresOfDigits = calculatesSumOfSquaresOfDigits(num);
-
-    if (numbersCovered.includes(sumOfSquaresOfDigits)) return false;
-
-    numbersCovered.push(sumOfSquaresOfDigits);
-    num = sumOfSquaresOfDigits;
-  }
-
-  return true;
-};
+export const checksHappyNumber = (num: number): boolean => {};
 

[Killed] EqualityOperator
src/exercises/happyNumbers/happy.ts:14:7
 };
 
 export const checksHappyNumber = (num: number): boolean => {
-  if (num < 1 || num % 1 !== 0) return false;
+  if (num >= 1 || num % 1 !== 0) return false;
   const numbersCovered = [];
 

[Killed] ConditionalExpression
src/exercises/happyNumbers/happy.ts:14:18
 };
 
 export const checksHappyNumber = (num: number): boolean => {
-  if (num < 1 || num % 1 !== 0) return false;
+  if (num < 1 || true) return false;
   const numbersCovered = [];
 

[Survived] ArrayDeclaration
src/exercises/happyNumbers/happy.ts:15:26
 
 export const checksHappyNumber = (num: number): boolean => {
   if (num < 1 || num % 1 !== 0) return false;
-  const numbersCovered = [];
+  const numbersCovered = ["Stryker was here"];
 
   while (num !== 1) {

[Killed] ConditionalExpression
src/exercises/happyNumbers/happy.ts:17:10
   if (num < 1 || num % 1 !== 0) return false;
   const numbersCovered = [];
 
-  while (num !== 1) {
+  while (false) {
     const sumOfSquaresOfDigits = calculatesSumOfSquaresOfDigits(num);
 

[Killed] EqualityOperator
src/exercises/happyNumbers/happy.ts:17:10
   if (num < 1 || num % 1 !== 0) return false;
   const numbersCovered = [];
 
-  while (num !== 1) {
+  while (num === 1) {
     const sumOfSquaresOfDigits = calculatesSumOfSquaresOfDigits(num);
 

[Killed] BooleanLiteral
src/exercises/happyNumbers/happy.ts:20:63
   while (num !== 1) {
     const sumOfSquaresOfDigits = calculatesSumOfSquaresOfDigits(num);
 
-    if (numbersCovered.includes(sumOfSquaresOfDigits)) return false;
+    if (numbersCovered.includes(sumOfSquaresOfDigits)) return true;
 
     numbersCovered.push(sumOfSquaresOfDigits);

[Killed] ConditionalExpression
src/exercises/happyNumbers/happy.ts:20:9
   while (num !== 1) {
     const sumOfSquaresOfDigits = calculatesSumOfSquaresOfDigits(num);
 
-    if (numbersCovered.includes(sumOfSquaresOfDigits)) return false;
+    if (true) return false;
 
     numbersCovered.push(sumOfSquaresOfDigits);
