[Killed] LogicalOperator
src/exercises/multiplesOfThreeOrFive/exercise.ts:4:46
 import { checkIfIsMultiples, calculateMultipleBaseOnRuleFunction } from './multiples';
 
 const rules = {
-  multiple3And5: (value: number): boolean => checkIfIsMultiples(value, 3) && checkIfIsMultiples(value, 5),
+  multiple3And5: (value: number): boolean => checkIfIsMultiples(value, 3) || checkIfIsMultiples(value, 5),
   multiple3or5: (value: number): boolean => checkIfIsMultiples(value, 3) || checkIfIsMultiples(value, 5),
   multiple3or5and7: (value: number): boolean => rules.multiple3or5(value) && checkIfIsMultiples(value, 7),

[Killed] ConditionalExpression
src/exercises/multiplesOfThreeOrFive/exercise.ts:4:46
 import { checkIfIsMultiples, calculateMultipleBaseOnRuleFunction } from './multiples';
 
 const rules = {
-  multiple3And5: (value: number): boolean => checkIfIsMultiples(value, 3) && checkIfIsMultiples(value, 5),
+  multiple3And5: (value: number): boolean => true,
   multiple3or5: (value: number): boolean => checkIfIsMultiples(value, 3) || checkIfIsMultiples(value, 5),
   multiple3or5and7: (value: number): boolean => rules.multiple3or5(value) && checkIfIsMultiples(value, 7),

[Killed] ConditionalExpression
src/exercises/multiplesOfThreeOrFive/exercise.ts:5:45
 
 const rules = {
   multiple3And5: (value: number): boolean => checkIfIsMultiples(value, 3) && checkIfIsMultiples(value, 5),
-  multiple3or5: (value: number): boolean => checkIfIsMultiples(value, 3) || checkIfIsMultiples(value, 5),
+  multiple3or5: (value: number): boolean => true,
   multiple3or5and7: (value: number): boolean => rules.multiple3or5(value) && checkIfIsMultiples(value, 7),
 };

[Killed] ConditionalExpression
src/exercises/multiplesOfThreeOrFive/exercise.ts:5:45
 
 const rules = {
   multiple3And5: (value: number): boolean => checkIfIsMultiples(value, 3) && checkIfIsMultiples(value, 5),
-  multiple3or5: (value: number): boolean => checkIfIsMultiples(value, 3) || checkIfIsMultiples(value, 5),
+  multiple3or5: (value: number): boolean => false,
   multiple3or5and7: (value: number): boolean => rules.multiple3or5(value) && checkIfIsMultiples(value, 7),
 };

[Killed] ConditionalExpression
src/exercises/multiplesOfThreeOrFive/exercise.ts:6:49
 const rules = {
   multiple3And5: (value: number): boolean => checkIfIsMultiples(value, 3) && checkIfIsMultiples(value, 5),
   multiple3or5: (value: number): boolean => checkIfIsMultiples(value, 3) || checkIfIsMultiples(value, 5),
-  multiple3or5and7: (value: number): boolean => rules.multiple3or5(value) && checkIfIsMultiples(value, 7),
+  multiple3or5and7: (value: number): boolean => true,
 };
 

[Killed] ArrowFunction
src/exercises/multiplesOfThreeOrFive/exercise.ts:6:21
 const rules = {
   multiple3And5: (value: number): boolean => checkIfIsMultiples(value, 3) && checkIfIsMultiples(value, 5),
   multiple3or5: (value: number): boolean => checkIfIsMultiples(value, 3) || checkIfIsMultiples(value, 5),
-  multiple3or5and7: (value: number): boolean => rules.multiple3or5(value) && checkIfIsMultiples(value, 7),
+  multiple3or5and7: () => undefined,
 };
 

[Killed] BlockStatement
src/exercises/multiplesOfThreeOrFive/exercise.ts:9:48
   multiple3or5and7: (value: number): boolean => rules.multiple3or5(value) && checkIfIsMultiples(value, 7),
 };
 
-export const sumMultiples3and5 = (): number => {
-  const sum = calculateMultipleBaseOnRuleFunction(1000, rules.multiple3And5);
-  return sum;
-};
+export const sumMultiples3and5 = (): number => {};
 
 export const sumMultiples3or5 = (): number => {

[Killed] BlockStatement
src/exercises/multiplesOfThreeOrFive/exercise.ts:14:47
   return sum;
 };
 
-export const sumMultiples3or5 = (): number => {
-  const sum = calculateMultipleBaseOnRuleFunction(1000, rules.multiple3or5);
-  return sum;
-};
+export const sumMultiples3or5 = (): number => {};
 
 export const sumMultiple3or5and7 = (): number => {

[Killed] BlockStatement
src/exercises/multiplesOfThreeOrFive/exercise.ts:19:50
   return sum;
 };
 
-export const sumMultiple3or5and7 = (): number => {
-  const sum = calculateMultipleBaseOnRuleFunction(1000, rules.multiple3or5and7);
-  return sum;
-};
+export const sumMultiple3or5and7 = (): number => {};
 
