[Killed] BlockStatement
src/exercises/multiplesOfThreeOrFive/multiples.ts:1:98
-export const calculateMultipleBaseOnRuleFunction = (maxValue: number, rule: Function): number => {
-  let counter = 0;
-
-  for (let i = 1; i < maxValue; i++) {
-    if (rule(i)) {
-      counter += i;
-    }
-  }
-
-  return counter;
-};
+export const calculateMultipleBaseOnRuleFunction = (maxValue: number, rule: Function): number => {};
 
 export const checkIfIsMultiples = (valor: number, multiplo: number): boolean => valor % multiplo === 0;

[Killed] EqualityOperator
src/exercises/multiplesOfThreeOrFive/multiples.ts:4:19
 export const calculateMultipleBaseOnRuleFunction = (maxValue: number, rule: Function): number => {
   let counter = 0;
 
-  for (let i = 1; i < maxValue; i++) {
+  for (let i = 1; i >= maxValue; i++) {
     if (rule(i)) {
       counter += i;

[Killed] EqualityOperator
src/exercises/multiplesOfThreeOrFive/multiples.ts:4:19
 export const calculateMultipleBaseOnRuleFunction = (maxValue: number, rule: Function): number => {
   let counter = 0;
 
-  for (let i = 1; i < maxValue; i++) {
+  for (let i = 1; i <= maxValue; i++) {
     if (rule(i)) {
       counter += i;

[Killed] ConditionalExpression
src/exercises/multiplesOfThreeOrFive/multiples.ts:5:9
   let counter = 0;
 
   for (let i = 1; i < maxValue; i++) {
-    if (rule(i)) {
+    if (false) {
       counter += i;
     }

[Killed] BlockStatement
src/exercises/multiplesOfThreeOrFive/multiples.ts:5:18
   let counter = 0;
 
   for (let i = 1; i < maxValue; i++) {
-    if (rule(i)) {
-      counter += i;
-    }
+    if (rule(i)) {}
   }
 

[Killed] ArrowFunction
src/exercises/multiplesOfThreeOrFive/multiples.ts:13:35
   return counter;
 };
 
-export const checkIfIsMultiples = (valor: number, multiplo: number): boolean => valor % multiplo === 0;
+export const checkIfIsMultiples = () => undefined;
 

[Killed] ConditionalExpression
src/exercises/multiplesOfThreeOrFive/multiples.ts:13:81
   return counter;
 };
 
-export const checkIfIsMultiples = (valor: number, multiplo: number): boolean => valor % multiplo === 0;
+export const checkIfIsMultiples = (valor: number, multiplo: number): boolean => false;
 
