[Killed] BlockStatement
src/exercises/wordInNumber/exercise.ts:12:54
   isMultiple3or5: boolean
 }
 
-const exercise = (word: string): exerciseResponse => {
-  const resultWordInNumber = convertWordToNumbers(word)
-  const isHappy = checksHappyNumber(resultWordInNumber)
-  const isPrime = checkNumberIsPrime(resultWordInNumber)
-  const isMultiple3or5 = checkIfIsMultiples(resultWordInNumber, 3) || checkIfIsMultiples(resultWordInNumber, 5)
-
-  return {
-    isPrime,
-    isHappy,
-    isMultiple3or5
-  }
-}
+const exercise = (word: string): exerciseResponse => {}
 
 export default exercise

[Killed] ConditionalExpression
src/exercises/wordInNumber/exercise.ts:16:26
   const resultWordInNumber = convertWordToNumbers(word)
   const isHappy = checksHappyNumber(resultWordInNumber)
   const isPrime = checkNumberIsPrime(resultWordInNumber)
-  const isMultiple3or5 = checkIfIsMultiples(resultWordInNumber, 3) || checkIfIsMultiples(resultWordInNumber, 5)
+  const isMultiple3or5 = false
 
   return {

[Killed] LogicalOperator
src/exercises/wordInNumber/exercise.ts:16:26
   const resultWordInNumber = convertWordToNumbers(word)
   const isHappy = checksHappyNumber(resultWordInNumber)
   const isPrime = checkNumberIsPrime(resultWordInNumber)
-  const isMultiple3or5 = checkIfIsMultiples(resultWordInNumber, 3) || checkIfIsMultiples(resultWordInNumber, 5)
+  const isMultiple3or5 = checkIfIsMultiples(resultWordInNumber, 3) && checkIfIsMultiples(resultWordInNumber, 5)
 
   return {
