[Killed] BlockStatement
src/exercises/wordInNumber/primeNumbers.ts:1:54
-const checkNumberIsPrime = (num: number): boolean => {
-  if (num <= 1) return false
-
-  for (let i = 2; i < num; i++) {
-    if (num % i === 0) return false
-  }
-
-  return true
-}
+const checkNumberIsPrime = (num: number): boolean => {}
 
 export { checkNumberIsPrime }

[Killed] BooleanLiteral
src/exercises/wordInNumber/primeNumbers.ts:2:24
 const checkNumberIsPrime = (num: number): boolean => {
-  if (num <= 1) return false
+  if (num <= 1) return true
 
   for (let i = 2; i < num; i++) {

[Killed] EqualityOperator
src/exercises/wordInNumber/primeNumbers.ts:2:7
 const checkNumberIsPrime = (num: number): boolean => {
-  if (num <= 1) return false
+  if (num < 1) return false
 
   for (let i = 2; i < num; i++) {

[Killed] ConditionalExpression
src/exercises/wordInNumber/primeNumbers.ts:4:19
 const checkNumberIsPrime = (num: number): boolean => {
   if (num <= 1) return false
 
-  for (let i = 2; i < num; i++) {
+  for (let i = 2; false; i++) {
     if (num % i === 0) return false
   }

[Killed] EqualityOperator
src/exercises/wordInNumber/primeNumbers.ts:4:19
 const checkNumberIsPrime = (num: number): boolean => {
   if (num <= 1) return false
 
-  for (let i = 2; i < num; i++) {
+  for (let i = 2; i >= num; i++) {
     if (num % i === 0) return false
   }

[Killed] ArithmeticOperator
src/exercises/wordInNumber/primeNumbers.ts:5:9
   if (num <= 1) return false
 
   for (let i = 2; i < num; i++) {
-    if (num % i === 0) return false
+    if (num * i === 0) return false
   }
 

[Killed] BooleanLiteral
src/exercises/wordInNumber/primeNumbers.ts:5:31
   if (num <= 1) return false
 
   for (let i = 2; i < num; i++) {
-    if (num % i === 0) return false
+    if (num % i === 0) return true
   }
 
