[Killed] BlockStatement
src/exercises/wordInNumber/wordInNumber.ts:1:56
-const convertWordToNumbers = (word: string): number => {
-  const allowedLetters = [
-    'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm',
-    'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z',
-    'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M',
-    'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z',
-  ];
-
-  let sumOfWordNumbers = 0;
-
-  word.split('').forEach((letter) => {
-    const num = allowedLetters.findIndex((allowedLetter) => letter === allowedLetter);
-    const resultOfLetterInNumber = num + 1;
-    sumOfWordNumbers += resultOfLetterInNumber;
-  });
-
-  return sumOfWordNumbers;
-};
+const convertWordToNumbers = (word: string): number => {};
 
 export { convertWordToNumbers };

[Survived] StringLiteral
src/exercises/wordInNumber/wordInNumber.ts:3:60
 const convertWordToNumbers = (word: string): number => {
   const allowedLetters = [
-    'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm',
+    'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', "", 'm',
     'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z',
     'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M',

[Survived] StringLiteral
src/exercises/wordInNumber/wordInNumber.ts:3:55
 const convertWordToNumbers = (word: string): number => {
   const allowedLetters = [
-    'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm',
+    'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', "", 'l', 'm',
     'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z',
     'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M',

[Killed] StringLiteral
src/exercises/wordInNumber/wordInNumber.ts:4:65
 const convertWordToNumbers = (word: string): number => {
   const allowedLetters = [
     'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm',
-    'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z',
+    'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', "",
     'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M',
     'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z',

[Killed] StringLiteral
src/exercises/wordInNumber/wordInNumber.ts:4:45
 const convertWordToNumbers = (word: string): number => {
   const allowedLetters = [
     'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm',
-    'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z',
+    'n', 'o', 'p', 'q', 'r', 's', 't', 'u', "", 'w', 'x', 'y', 'z',
     'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M',
     'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z',

[Survived] StringLiteral
src/exercises/wordInNumber/wordInNumber.ts:5:65
   const allowedLetters = [
     'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm',
     'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z',
-    'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M',
+    'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', "",
     'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z',
   ];

[Survived] StringLiteral
src/exercises/wordInNumber/wordInNumber.ts:5:40
   const allowedLetters = [
     'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm',
     'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z',
-    'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M',
+    'A', 'B', 'C', 'D', 'E', 'F', 'G', "", 'I', 'J', 'K', 'L', 'M',
     'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z',
   ];

[Survived] StringLiteral
src/exercises/wordInNumber/wordInNumber.ts:6:25
     'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm',
     'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z',
     'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M',
-    'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z',
+    'N', 'O', 'P', 'Q', "", 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z',
   ];
 

[Survived] StringLiteral
src/exercises/wordInNumber/wordInNumber.ts:6:10
     'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm',
     'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z',
     'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M',
-    'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z',
+    'N', "", 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z',
   ];
 

[Killed] BlockStatement
src/exercises/wordInNumber/wordInNumber.ts:11:38
 
   let sumOfWordNumbers = 0;
 
-  word.split('').forEach((letter) => {
-    const num = allowedLetters.findIndex((allowedLetter) => letter === allowedLetter);
-    const resultOfLetterInNumber = num + 1;
-    sumOfWordNumbers += resultOfLetterInNumber;
-  });
+  word.split('').forEach((letter) => {});
 
   return sumOfWordNumbers;

[Killed] EqualityOperator
src/exercises/wordInNumber/wordInNumber.ts:12:61
   let sumOfWordNumbers = 0;
 
   word.split('').forEach((letter) => {
-    const num = allowedLetters.findIndex((allowedLetter) => letter === allowedLetter);
+    const num = allowedLetters.findIndex((allowedLetter) => letter !== allowedLetter);
     const resultOfLetterInNumber = num + 1;
     sumOfWordNumbers += resultOfLetterInNumber;

[Killed] ArrowFunction
src/exercises/wordInNumber/wordInNumber.ts:12:42
   let sumOfWordNumbers = 0;
 
   word.split('').forEach((letter) => {
-    const num = allowedLetters.findIndex((allowedLetter) => letter === allowedLetter);
+    const num = allowedLetters.findIndex(() => undefined);
     const resultOfLetterInNumber = num + 1;
     sumOfWordNumbers += resultOfLetterInNumber;

[Killed] ArithmeticOperator
src/exercises/wordInNumber/wordInNumber.ts:13:36
 
   word.split('').forEach((letter) => {
     const num = allowedLetters.findIndex((allowedLetter) => letter === allowedLetter);
-    const resultOfLetterInNumber = num + 1;
+    const resultOfLetterInNumber = num - 1;
     sumOfWordNumbers += resultOfLetterInNumber;
   });
