[Killed] BlockStatement
learning-tests-js/src/helpers/arrayHelper.ts:1:58
-const sumValuesFromArray = (values: number[]): number => {
-  return values.reduce((accumulator, currentValue) => accumulator + currentValue)
-}
+const sumValuesFromArray = (values: number[]): number => {}
 
 const removeDuplicateValuesInArray = (list: number[]): number[] => {

[Killed] ArrowFunction
learning-tests-js/src/helpers/arrayHelper.ts:2:24
 const sumValuesFromArray = (values: number[]): number => {
-  return values.reduce((accumulator, currentValue) => accumulator + currentValue)
+  return values.reduce(() => undefined)
 }
 

[Killed] ArithmeticOperator
learning-tests-js/src/helpers/arrayHelper.ts:2:55
 const sumValuesFromArray = (values: number[]): number => {
-  return values.reduce((accumulator, currentValue) => accumulator + currentValue)
+  return values.reduce((accumulator, currentValue) => accumulator - currentValue)
 }
 

[Killed] BlockStatement
learning-tests-js/src/helpers/arrayHelper.ts:5:68
   return values.reduce((accumulator, currentValue) => accumulator + currentValue)
 }
 
-const removeDuplicateValuesInArray = (list: number[]): number[] => {
-  list = [...new Set(list)]
-  return list
-}
+const removeDuplicateValuesInArray = (list: number[]): number[] => {}
 
 export { sumValuesFromArray, removeDuplicateValuesInArray }
